"""
Вывести все числа от 1 до 300 кратные 9
"""

for k in range(1, 301):
    if k % 9 == 0:
        print(k, end=' ')